"""Data for verifying web elements on pages with exercises on the 'ru' local"""


class ExercisesRuPagesData:
    tab_title_ru = ("Речевые упражнения (готовы для занятий) | BrainUp",)

    b1 = ''
    b2 = 'Речевые упражнения (готовы для занятий)'
    breadcrumbs_text_ru_similar_phrases = (b1, b2, 'Похожие фразы')
    breadcrumbs_text_words_ru = (b1, b2, 'Слова')

    group_links_text = ('СЛОВА', 'СЛОВА КОРОЛЁВОЙ', 'ПОХОЖИЕ ФРАЗЫ', 'ГРУППА СЛОВ', 'ПРЕДЛОЖЕНИЯ',
                        'СЛОВА С ЧАСТОТНОЙ ГРУППИРОВКОЙ')

    group_link_titles = ('Распознавание слов',
                         'Слова по методическому пособию Инны Васильевны Королевой Учусь слушать и говорить',
                         'Распознавание похожих фраз', 'Распознавание последовательности слов',
                         'Распознавание предложений', 'Слова с частотной группировкой')

    group_link_active_links = ('Слова', 'Слова Королёвой', 'Похожие фразы', 'Группа слов', 'Предложения',
                               'Слова с частотной группировкой')
