"""Data for verifying web elements on the 'Exercises "Words"' page on the 'ru' local"""
from test_data.links import MainPageLinks as Links
from test_data.links import ExercisesUrls as ExUrls


class ExercisesRuWordsPageData:
    tab_title = ("Речевые упражнения (готовы для занятий) | BrainUp", "Speech exercises | BrainUp")
    tab_title_ru = ("Речевые упражнения (готовы для занятий) | BrainUp",)

    breadcrumbs_text = ('', 'Речевые упражнения (готовы для занятий)', 'Слова')

    group_links_text = ('СЛОВА', 'СЛОВА КОРОЛЁВОЙ', 'ПОХОЖИЕ ФРАЗЫ', 'ГРУППА СЛОВ', 'ПРЕДЛОЖЕНИЯ',
                        'ДИХОТИЧЕСКОЕ СЛУШАНИЕ', 'СЛОВА С ЧАСТОТНОЙ ГРУППИРОВКОЙ')

    group_link_titles = ('Распознавание слов',
                         'Слова по методическому пособию Инны Васильевны Королевой Учусь слушать и говорить',
                         'Распознавание похожих фраз', 'Распознавание последовательности слов',
                         'Распознавание предложений', 'Дихотическое слушание', 'Слова с частотной группировкой')

    group_link_active_links = ('Слова', 'Слова Королёвой', 'Похожие фразы', 'Группа слов', 'Предложения',
                               'Дихотическое слушание', 'Слова с частотной группировкой')

    subgroup_links_text = ('Семья', 'Любимый дом', 'Что я ем', 'Одежда', 'В школе', 'Математика', 'Домашние питомцы',
                           'Мир животных', 'Транспорт', 'Цвета и форма', 'В городе', 'В деревне', 'На прогулке',
                           'Погода', 'Стану кем хочу', 'Тело человека', 'Развлечения', 'Путешествия', 'В больнице',
                           'Что я чувствую', 'Игрушки', 'Насекомые', 'Интерьер', 'На кухне', 'Музыка',
                           'Музыкальные инструменты', 'Птицы', 'Украшения', 'История', 'Действия', 'Действия(слышимые)',
                           'Транспорт Дополнение', 'Транспорт (спецтехника)', 'Плодовые деревья и кусты', 'Растения',
                           'Деревья и кустарники', 'Спорт', 'В магазине', 'Парнокопытные', 'Породы собак',
                           'Канцелярские принадлежности', 'Цветы', 'Русский язык и литература', 'Физика', 'Биология',
                           'Инструменты')

    subgroup_link_titles = ('Слова про семью', 'Слова про дом', 'Слова о еде', 'Слова об одежде',
                            'Слова о школе и учёбе', 'Математика и её термины', 'Слова о домашних питомцах',
                            'Слова о животных', 'Слова о транспорте', 'Слова о понятиях цета и формы',
                            'Слова о жизни города', 'Слова из деревенской жизни', 'Слова о прогулке', 'Слова о погоде',
                            'Слова о профессии', 'Слова об организме', 'Слова из нашей жизни развлеченийи и игр',
                            'Слова из мира путешествий', 'Слова медицинские', 'Слова о чувствах и эмоциях', 'Игрушки',
                            'Насекомые', 'Интерьер', 'На кухне', 'Музыка', 'Музыкальные инструменты', 'Птицы',
                            'Украшения', 'История', 'Действия', 'Действия(слышимые)', 'Транспорт Дополнение',
                            'Транспорт (спецтехника)', 'Плодовые деревья и кусты', 'Растения', 'Деревья и кустарники',
                            'Спорт', 'В магазине', 'Парнокопытные', 'Породы собак', 'Канцелярские принадлежности',
                            'Цветы', 'Русский язык и литература', 'Физика', 'Биология', 'Инструменты')

    breadcrumbs_urls = (f"{Links.URL_GROUPS_PAGE}",
                        f"{Links.URL_GROUPS_PAGE}/2",
                        f"{Links.URL_GROUPS_PAGE}/2/series/1")

    # p = f"{Links.URL_GROUPS_PAGE}/2/series/"
    # group_link_urls = (f"{p}1", f"{p}2", f"{p}3", f"{p}4", f"{p}5", f"{p}6", f"{p}17")

    q = f"{ExUrls.URL_EXERCISES_RU_WORDS_PAGE}/subgroup/"
    subgroup_link_urls = (f"{q}1", f"{q}2", f"{q}3", f"{q}4", f"{q}5", f"{q}6", f"{q}7", f"{q}8", f"{q}9", f"{q}10",
                          f"{q}11", f"{q}12", f"{q}13", f"{q}14", f"{q}15", f"{q}16", f"{q}17", f"{q}18", f"{q}19",
                          f"{q}20", f"{q}21", f"{q}22", f"{q}23", f"{q}24", f"{q}25", f"{q}26", f"{q}27", f"{q}28",
                          f"{q}29", f"{q}30", f"{q}31", f"{q}32", f"{q}33", f"{q}34", f"{q}35", f"{q}36", f"{q}37",
                          f"{q}38", f"{q}39", f"{q}40", f"{q}41", f"{q}42", f"{q}43", f"{q}44", f"{q}45", f"{q}46")

    links_status_code = (200,)

    s = 'background-image: url("https://brnup.s3.eu-north-1.amazonaws.com/pictures/theme/'
    e = '.svg");'
    subgroup_links_style = (f"{s}family{e}", f"{s}home{e}", f"{s}food{e}", f"{s}clothes{e}", f"{s}school{e}",
                            f"{s}math{e}", f"{s}pets{e}", f"{s}animals{e}", f"{s}transport{e}", f"{s}colors{e}",
                            f"{s}city{e}", f"{s}country{e}", f"{s}walk{e}", f"{s}weather{e}", f"{s}future{e}",
                            f"{s}body{e}", f"{s}game{e}", f"{s}adventure{e}", f"{s}hospital{e}", f"{s}feelings{e}",
                            f"{s}toys{e}", f"{s}insects{e}", f"{s}interior{e}", f"{s}kitchen{e}", f"{s}music{e}",
                            f"{s}musical_instruments{e}", f"{s}birds{e}", f"{s}jewelry{e}", f"{s}history{e}",
                            f"{s}actions{e}", f"{s}audible_actions{e}", f"{s}more_transport{e}",
                            f"{s}special_transport{e}", f"{s}fruit_trees{e}", f"{s}plants{e}", f"{s}trees{e}",
                            f"{s}sport{e}", f"{s}shop{e}", f"{s}artiodactyls{e}", f"{s}dogs{e}", f"{s}stationery{e}",
                            f"{s}flowers{e}", f"{s}literature{e}", f"{s}physics{e}", f"{s}biology{e}",
                            f"{s}instruments{e}")
